# Merge de 3 dataframes

In [1]:
import pandas as pd

In [2]:
path="../ficheros_curso/merge/"

In [3]:
dfPed = pd.read_csv(path+"Pedidos.txt", sep=";")
dfPed.shape

(830, 6)

In [4]:
dfEmp = pd.read_csv(path+"Empleados.txt", sep=";")
dfEmp.shape

(9, 3)

In [5]:
dfEmpr = pd.read_csv(path+"Empresas.txt", sep=";")
dfEmpr.shape

(3, 2)

In [6]:
dfTotal = pd.merge(dfPed, dfEmp, left_on="idempleado", right_on="id")
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id,nombre,cargo
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas
1,10254,CHOPS,5,2,22.98,Suiza,5,Buchanan,Gerente de ventas
2,10269,WHITC,5,1,4.56,Estados Unidos,5,Buchanan,Gerente de ventas
3,10297,BLONP,5,2,5.74,Francia,5,Buchanan,Gerente de ventas
4,10320,WARTH,5,3,34.57,Finlandia,5,Buchanan,Gerente de ventas

In [7]:
dfTotal = dfTotal.merge(dfEmpr, left_on='idempresa', right_on='id')
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,nombre,cargo,id_y,empresa
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
1,10320,WARTH,5,3,34.57,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
2,10333,WARTH,5,3,0.59,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
3,10359,SEVES,5,3,288.43,Reino Unido,5,Buchanan,Gerente de ventas,3,Federal Shipping
4,10378,FOLKO,5,3,5.44,Suecia,5,Buchanan,Gerente de ventas,3,Federal Shipping

In [8]:
dfTotal.rename(columns={"nombre":"empleado"}, inplace=True)
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,empleado,cargo,id_y,empresa
0,10248,WILMK,5,3,32.38,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
1,10320,WARTH,5,3,34.57,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
2,10333,WARTH,5,3,0.59,Finlandia,5,Buchanan,Gerente de ventas,3,Federal Shipping
3,10359,SEVES,5,3,288.43,Reino Unido,5,Buchanan,Gerente de ventas,3,Federal Shipping
4,10378,FOLKO,5,3,5.44,Suecia,5,Buchanan,Gerente de ventas,3,Federal Shipping

In [9]:
dfTotal = dfTotal[['cliente','empleado','empresa','pais','importe']]
dfTotal.head()

  cliente  empleado           empresa         pais  importe
0   WILMK  Buchanan  Federal Shipping    Finlandia    32.38
1   WARTH  Buchanan  Federal Shipping    Finlandia    34.57
2   WARTH  Buchanan  Federal Shipping    Finlandia     0.59
3   SEVES  Buchanan  Federal Shipping  Reino Unido   288.43
4   FOLKO  Buchanan  Federal Shipping       Suecia     5.44

In [15]:
grupo = dfTotal.importe.groupby(dfTotal.pais)
type(grupo)

pandas.core.groupby.generic.SeriesGroupBy

In [16]:
grupo.mean()

pais
Alemania           92.485902
Argentina          37.411250
Austria           184.787500
Belgica            67.375789
Brasil             58.797470
Canada             73.269667
Dinamarca          77.566111
Espanya            37.473478
Estados Unidos    112.059593
Finlandia          41.011739
Francia            55.335000
Irlanda           145.012632
Italia             30.872857
Mexico             40.099286
Noruega            45.916667
Polonia            27.283333
Portugal           49.502308
Reino Unido        53.514727
Suecia             85.488421
Suiza              76.029444
Venezuela          59.460435
Name: importe, dtype: float64

In [11]:
dfTotal.importe.groupby(dfTotal.pais).sum()

pais
Alemania          11283.28
Argentina           598.58
Austria            7391.50
Belgica            1280.14
Brasil             4880.19
Canada             2198.09
Dinamarca          1396.19
Espanya             861.89
Estados Unidos    13783.33
Finlandia           943.27
Francia            4205.46
Irlanda            2755.24
Italia              864.44
Mexico             1122.78
Noruega             275.50
Polonia             163.70
Portugal            643.53
Reino Unido        2943.31
Suecia             3248.56
Suiza              1368.53
Venezuela          2735.18
Name: importe, dtype: float64

In [13]:
pd.set_option("display.max_rows", None)

In [14]:
dfTotal.importe.groupby([dfTotal.empresa,dfTotal.pais]).sum()

empresa           pais
Federal Shipping  Alemania          3646.99
                  Argentina           55.54
                  Austria           2107.10
                  Belgica            279.73
                  Brasil             823.84
                  Canada             848.29
                  Dinamarca          390.44
                  Espanya            128.52
                  Estados Unidos    5710.03
                  Finlandia          265.68
                  Francia           1790.99
                  Irlanda            602.12
                  Italia             203.36
                  Mexico             418.34
                  Noruega             38.64
                  Polonia             54.02
                  Portugal           256.04
                  Reino Unido        973.75
                  Suecia             532.95
                  Suiza              625.22
                  Venezuela          760.92
Speedy Express    Alemania          3642.50
                  Argentina          131.97
                  Austria           2218.57
                  Belgica            269.00
                  Brasil            1542.92
                  Canada             284.10
                  Dinamarca          400.84
                  Espanya            185.33
                  Estados Unidos    2294.72
                  Finlandia          278.01
                  Francia           1149.98
                  Irlanda            262.71
                  Italia             452.65
                  Mexico             176.31
                  Noruega             13.37
                  Polonia              8.72
                  Portugal            67.72
                  Reino Unido        735.88
                  Suecia             968.70
                  Suiza              250.53
                  Venezuela          821.34
United Package    Alemania          3993.79
                  Argentina          411.07
                  Austria           3065.83
                  Belgica            731.41
                  Brasil            2513.43
                  Canada            1065.70
                  Dinamarca          604.91
                  Espanya            548.04
                  Estados Unidos    5778.58
                  Finlandia          399.58
                  Francia           1264.49
                  Irlanda           1890.41
                  Italia             208.43
                  Mexico             528.13
                  Noruega            223.49
                  Polonia            100.96
                  Portugal           319.77
                  Reino Unido       1233.68
                  Suecia            1746.91
                  Suiza              492.78
                  Venezuela         1152.92
Name: importe, dtype: float64